from config import Config
class Strings:

    # ------------------------------------------------ Variable --------------------------------------------------------

    BUY_CONFIG = "💳 به بخش خرید کانفیگ خوش آمدید , لطفا سرور مد نظر رو انتخاب کنید"
    SHOP = "💰 به بخش فروشگاه خوش آمدید, از منوی زیر انتخاب کنید"
    MY_SUBSCRIPTION = ""
    SUPPORT = "💡 جهت پیام ارتباط با ادمین لطفا روی دکمه زیرین کلیک کنید 🌀"
    GET_CUSTOM_SHARJ = "📍 مبلغ مد نظر خود را به **تومان** وارد کنید (با اعداد لاتین) 💳"
    NOT_NUMBER = "❌مقدار ارسالی شما  به صورت عددی نیست , لطفا **به صورت عدد لاتین** ارسال کنید. ❌"
    WAITING = "⏳ لطفا منتظر بمانید "


    # -------------------------------------------------- lambda function -----------------------------------------------

    start_menu: str = lambda Name, UserId: f"👋 سلام [{Name}](tg://user?id={UserId}) عزیز به ربات خوش اومدی , از منوی زیر انتخاب کن ❤️"
    get_user_id: str = lambda UserId: "🔹 آیدی عددی شما :  <code>{}</code>".format(UserId)
    low_price: str = lambda Price: f"❌مقدار وارد شده کم است , حداقل مقدار شارژ برای شما {int(Price):,} تومان است ❌"
    refrral: str = lambda UserId: f"""
💎 لینک زیر را با دوستان خود به اشتراک بزارید و به ازای هر خرید ۱۰٪ از مبلغ خرید به کیف پول شما اضافه خواهد شد تا بتوانید محصولات داخل فروشگاه را بدون پرداخت هزینه دریافت کنید 💸


https://t.me/{Config.BOT_USERNAME}?start={UserId}
"""
    created_payment_link: str = lambda Price : f"🏧 لینک پرداخت شما به مبلغ {int(Price):,} تومان اماده شد , روی دکمه زیر کلیک کرده تا به صفحه هدایت شوید ♻️"

    # --------------------------------------------------- normal functions ---------------------------------------------

    def account(UserId: int) -> str:
        return """
    salam {}
    """.format(UserId)